XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/ch32v4x7_conf.h
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32v4x7_conf.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/12/01
* Description        : Library configuration file.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __CH32V4x7_CONF_H
#define __CH32V4x7_CONF_H

#include "ch32v4x7_adc.h"
#include "ch32v4x7_argb.h"
#include "ch32v4x7_bkp.h"
#include "ch32v4x7_can.h"
#include "ch32v4x7_crc.h"
#include "ch32v4x7_dac.h"
#include "ch32v4x7_dbgmcu.h"
#include "ch32v4x7_dma.h"
#include "ch32v4x7_dvp.h"
#include "ch32v4x7_eth.h"
#include "ch32v4x7_exti.h"
#include "ch32v4x7_flash.h"
#include "ch32v4x7_fsmc.h"
#include "ch32v4x7_gpio.h"
#include "ch32v4x7_i2c.h"
#include "ch32v4x7_i3c.h"
#include "ch32v4x7_iwdg.h"
#include "ch32v4x7_ltdc.h"
#include "ch32v4x7_opa.h"
#include "ch32v4x7_psram.h"
#include "ch32v4x7_pwr.h"
#include "ch32v4x7_rcc.h"
#include "ch32v4x7_rng.h"
#include "ch32v4x7_rtc.h"
#include "ch32v4x7_sdio.h"
#include "ch32v4x7_spi.h"
#include "ch32v4x7_tim.h"
#include "ch32v4x7_usart.h"
#include "ch32v4x7_wwdg.h"
#include "ch32v4x7_usb.h"


#endif /* __CH32V4x7_CONF_H */


	
	
	
